Amiya200/stm32_water_tank/Core/Src/model_handle.c
// Handle Dry Run logic within the motor control protections
static void dry_run_protection(void)
{
    uint32_t now = HAL_GetTick();

    if (motorStatus == 1U) {           // Motor is ON
        if (!senseDryRun) {            // ❌ DryRun FALSE → turn OFF after delay
            if (!dryTimerArmed) {
                dryTimerArmed = true;
                dryStopDeadline = now + (uint32_t)DRY_STOP_DELAY_SECONDS * 1000UL;
            } else if ((int32_t)(now - dryStopDeadline) >= 0) {
                ModelHandle_StopAllModesAndMotor();
//                printf("Motor stopped: dryRun FALSE condition.\n");
            }
        } else {                       // ✅ DryRun TRUE → keep motor ON
            dryTimerArmed = false;
            dryStopDeadline = 0;
        }
    } else {
        // Motor OFF → reset timer
        dryTimerArmed = false;
        dryStopDeadline = 0;
    }
}


/* =========================
   SMART DRY-RUN MOTOR HANDLER
   ========================= */
//static bool     dryMotorDelayActive = false;
//static uint32_t dryMotorRestartTime = 0;
//#define DRY_RESTART_DELAY_MS   8000U   // delay before motor auto-restarts (8s)
//#define DRY_MOTOR_OFF_DELAY_MS 5000U   // delay before motor auto-stops (5s)
// User-modifiable dry-run timing variables (ms)
uint32_t dryProbeOnMs  = 30000UL;   // motor ON time (default 30 s)
uint32_t dryProbeOffMs = 30000UL;   // motor OFF time (default 30 s)
uint32_t dryConfirmMs  = 2000UL;
// =====================================================
// SMART DRY-RUN HANDLER (non-destructive to modes)
// =====================================================
// =====================================================
// FINAL SMART DRY-RUN HANDLER (stable, non-flickering)
// =====================================================
//
// Behavior summary:
// 🟢 Motor stays OFF initially
// 🟢 If dry condition persists, motor turns ON for a probe (5s)
// 🔴 If still dry after probe → motor OFF for 10s pause
// 🔁 Then repeats until water detected
// 💧 If water present, motor keeps running normally
// =====================================================

void ModelHandle_SoftDryRunHandler(void)
{
    static enum {
        DRY_STATE_IDLE = 0,      // motor off, waiting
        DRY_STATE_PROBING,       // motor on, testing for water
        DRY_STATE_NORMAL         // normal continuous run
    } dryState = DRY_STATE_IDLE;

    static uint32_t stateDeadlineMs = 0;
    static bool initialized = false;
    static bool confirming = false;
    static uint32_t confirmStart = 0;

    uint32_t now = HAL_GetTick();

    // --- Initialization (only once)
    if (!initialized) {
        stop_motor_keep_modes();
        dryState = DRY_STATE_IDLE;
        initialized = true;
    }

    // --- Update sensor
    ModelHandle_CheckDryRun();   // senseDryRun == true → water present

    // --- Ensure mode is active
    bool modeActive = (
        manualActive ||
        semiAutoActive ||
        timerActive ||
        searchActive ||
        countdownActive ||
        twistActive
    );

    if (!modeActive) {
        if (Motor_GetStatus()) stop_motor_keep_modes();
        dryState = DRY_STATE_IDLE;
        confirming = false;
        return;
    }

    // --- State Machine ---
    switch (dryState)
    {
        /* --------------------------------------------------------
           💤 IDLE — motor off, waiting before probe
        -------------------------------------------------------- */
        case DRY_STATE_IDLE:
            stop_motor_keep_modes();
            if ((int32_t)(now - stateDeadlineMs) >= 0) {
                start_motor();
                dryState = DRY_STATE_PROBING;
                stateDeadlineMs = now + dryProbeOnMs;
            }
            break;

        /* --------------------------------------------------------
           🔍 PROBING — motor on for testing water presence
        -------------------------------------------------------- */
        case DRY_STATE_PROBING:
            if ((int32_t)(now - stateDeadlineMs) >= 0) {
                ModelHandle_CheckDryRun();
                if (!senseDryRun) {
                    // still dry → stop and go to IDLE
                    stop_motor_keep_modes();
                    dryState = DRY_STATE_IDLE;
                    stateDeadlineMs = now + dryProbeOffMs;
                } else {
                    // water detected → go normal
                    dryState = DRY_STATE_NORMAL;
                }
            }
            break;

        /* --------------------------------------------------------
           💧 NORMAL — motor ON continuously while water present
        -------------------------------------------------------- */
        case DRY_STATE_NORMAL:
            if (!senseDryRun) {
                // lost water → confirm before stopping
                if (!confirming) {
                    confirming = true;
                    confirmStart = now;
                }

                if ((int32_t)(now - confirmStart) >= (int32_t)dryConfirmMs) {
                    stop_motor_keep_modes();
                    dryState = DRY_STATE_IDLE;
                    stateDeadlineMs = now + dryProbeOffMs;
                    confirming = false;
                }
            } else {
                confirming = false;
                if (!Motor_GetStatus())
                    start_motor();  // ensure ON while water present
            }
            break;
    }
}

// Function to call periodically to process dry run checks and pro




static inline bool dry_raw_is_dry(void)
{
//    float v = adcData.voltages[0];
//    if (DRY_ACTIVE_LOW) return (v < DRY_THRESHOLD_V);
//    else                return (v > DRY_THRESHOLD_V);
}

/* =========================
   Manual Mode
   ========================= */
void ModelHandle_ToggleManual(void)
{
    // toggling manual should dominate and clear other modes
    bool will_on = !manualActive;

    if (will_on) {
        clear_all_modes();
        manualOverride = true;
        manualActive   = true;
        start_motor();
        //printf("Manual ON\r\n");
    } else {
        ModelHandle_StopAllModesAndMotor(); // OFF should clear everything
        //printf("Manual OFF\r\n");
    }
    ModelHandle_SaveCurrentStateToEEPROM();
}

