Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_ManualLongPress(void)
{
    //printf("Manual Long Press → System Reset\r\n");
    HAL_Delay(100);
    NVIC_SystemReset();
}

/* ============================================================
   COUNTDOWN MODE
   ============================================================ */
volatile uint16_t countdownRemainingRuns = 0;

static uint32_t cd_deadline_ms      = 0;
static uint32_t cd_rest_deadline_ms = 0;
static uint32_t cd_run_seconds      = 0;
static bool     cd_in_rest          = false;
static const uint32_t CD_REST_MS    = 3000;

void ModelHandle_StopCountdown(void)
{
    stop_motor_keep_modes();
    countdownActive        = false;
    countdownMode          = false;
    countdownRemainingRuns = 0;
    cd_run_seconds         = 0;
    cd_in_rest             = false;
    countdownDuration      = 0;
}
static void countdown_start_one_run(void)
{
    cd_deadline_ms    = now_ms() + (cd_run_seconds * 1000UL);
    countdownDuration = cd_run_seconds;
    cd_in_rest        = false;
    start_motor();
}
void ModelHandle_StartCountdown(uint32_t seconds_per_run, uint16_t repeats)
{
    if (seconds_per_run == 0 || repeats == 0) {
        ModelHandle_StopCountdown();
        return;
    }

    clear_all_modes();
    countdownMode          = true;
    countdownActive        = true;
    cd_run_seconds         = seconds_per_run;
    countdownRemainingRuns = repeats;
    cd_in_rest             = false;

    countdown_start_one_run();
    ModelHandle_SaveCurrentStateToEEPROM();
}
static void countdown_tick(void)
{
    if (!countdownActive) return;
    uint32_t now = now_ms();

    if (cd_in_rest) {
        if ((int32_t)(cd_rest_deadline_ms - now) <= 0) {
            if (countdownRemainingRuns > 0) {
                countdown_start_one_run();
            } else {
                ModelHandle_StopCountdown();
            }
        }
        return;
    }

    if ((int32_t)(cd_deadline_ms - now) > 0) {
        uint32_t rem_ms = cd_deadline_ms - now;
        countdownDuration = (rem_ms + 999U) / 1000U;

        if (isTankFull()) {
            ModelHandle_StopAllModesAndMotor(); // terminal condition -> clear all modes
        }
        return;
    }

    stop_motor_keep_modes();
    if (countdownRemainingRuns > 0) countdownRemainingRuns--;
    if (countdownRemainingRuns == 0) {
        ModelHandle_StopCountdown();
        return;
    }

    cd_in_rest          = true;
    cd_rest_deadline_ms = now + CD_REST_MS;
    countdownDuration   = 0;
}

/* =======================
   TWIST MODE
   ======================= */
static bool     twist_on_phase       = false;
static uint32_t twist_phase_deadline = 0;
/* DRY counter must not accumulate while motor is OFF */
static uint8_t  twist_dry_cnt        = 0;
static bool     twist_priming        = false;
static uint32_t twist_prime_deadline = 0;

/* Count DRY only while motor is ON to avoid latch-off after first OFF */
static inline bool isDryLowSupply_debounced(void)
{
//    if (!Motor_GetStatus()) {
//        // If motor is OFF, do not count; keep counter at 0
//        twist_dry_cnt = 0;
//        return false;
//    }
//
//    bool raw = dry_raw_is_dry();
//    if (raw) {
//        if (twist_dry_cnt < 255) twist_dry_cnt++;
//    } else {
//        twist_dry_cnt = 0;
//    }
//    return (twist_dry_cnt >= 3);
}
static inline void twist_arm_priming(void)
{
    if (TWIST_PRIME_SECONDS > 0) {
        twist_priming        = true;
        twist_prime_deadline = now_ms() + (uint32_t)TWIST_PRIME_SECONDS * 1000UL;
    } else {
        twist_priming        = false;
        twist_prime_deadline = 0;
    }
}

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s)
{
    clear_all_modes();
    if (on_s == 0)  on_s  = 1;
    if (off_s == 0) off_s = 1;

    twistSettings.onDurationSeconds  = on_s;
    twistSettings.offDurationSeconds = off_s;
    twistSettings.twistActive  = true;
    twistActive                = true;
    twist_on_phase       = false;
    twist_phase_deadline = now_ms() + (uint32_t)twistSettings.offDurationSeconds * 1000UL;
    twist_dry_cnt        = 0;
    // Do NOT arm priming here; it's armed when ON actually starts.

    twist_arm_priming();
    ModelHandle_SaveCurrentStateToEEPROM();
}

void ModelHandle_StopTwist(void)
{
    twistSettings.twistActive = false;
    twistActive = false;
    twist_priming  = false;
    twist_dry_cnt  = 0;
    stop_motor_keep_modes();
}
// Call this from your main scheduler at ~10–100ms rate
// Call ~every 10–100 ms from your main loop/scheduler
void twist_tick(void)
{
    // 0) Inert unless explicitly enabled by the user
    if (!twistSettings.twistActive) {
        // Defensive: never force motor here—other modes own it.
        return;
    }

    uint32_t tnow = now_ms();

    // 1) Global safety gates (if your project uses these flags)
    //    If any protection is latched, keep Twist "enabled" but stop driving the motor.
    if (senseOverLoad || senseOverUnderVolt || senseMaxRunReached) {
        stop_motor_keep_modes();   // do not clear modes; just stop motor output
        return;
    }

    // 2) Priming window logic:
    //    When we first enter an ON phase we allow a short "prime" even if the sensor reads dry,
    //    to build initial pressure. This DOES NOT move the phase deadline.
    if (twist_priming) {
        if ((int32_t)(twist_prime_deadline - tnow) > 0) {
            if (!Motor_GetStatus()) start_motor();   // stay ON during priming
            return;                                  // do not touch phase deadline
        } else {
            twist_priming = false;                   // priming finished
        }
    }

    // 3) While in ON phase, you may optionally gate on "dry" (if your design wants this).
    //    We DON’T toggle the motor from ADC elsewhere; we only *observe* a dry flag here.
    //    If you don’t want dry handling in Twist, you can remove this block.
//#if defined(DRY_STOP_DELAY_SECONDS) && (DRY_STOP_DELAY_SECONDS > 0)
//    if (twist_on_phase) {
//        // If a dry condition is being signaled by the sensing layer, count it.
//        if (senseDryRun) {
//            if (twist_dry_cnt < 0xFF) twist_dry_cnt++;
//        } else {
//            twist_dry_cnt = 0;
//        }
//
//        // If dry persisted long enough, end the ON phase early and jump to OFF.
//        if (twist_dry_cnt >= (uint8_t)DRY_STOP_DELAY_SECONDS) {
//            stop_motor_keep_modes();
//            twist_on_phase       = false;
//            twist_dry_cnt        = 0;
//            twist_phase_deadline = tnow + (uint32_t)twistSettings.offDurationSeconds * 1000UL;
//            return;
//        }
//    }
//#endif
//
    // 4) Phase timing: flip when deadline elapses (signed compare prevents wrap issues).
    if ((int32_t)(twist_phase_deadline - tnow) <= 0) {
        twist_on_phase = !twist_on_phase;

        if (twist_on_phase) {
            // Entering ON phase
            twist_dry_cnt        = 0;
            start_motor();
            twist_phase_deadline = tnow + (uint32_t)twistSettings.onDurationSeconds * 1000UL;

